cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        // Changer la fréquence seulement si on est en RX
        Radio::setCarrier(Radio::Carrier::Frequency, iohc_radio->scan_freqs[iohc_radio->currentFreqIdx]);

        // ESP_LOGV("IOHC", "FHSS hop to freq[%d]: %d Hz",
        //  iohc_radio->currentFreqIdx,
        //  iohc_radio->scan_freqs[iohc_radio->currentFreqIdx]);
    }

    /**
         * Verrouille le FHSS avec une raison spécifique
         */
    void iohcRadio::lockFHSS(const FHSSLockReason reason) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            // Garder la raison la plus "forte"
            if (reason > fhssLockReason) {
                fhssLockReason = reason;
                f_lock_hop = true;
                lastActivityTime = millis();

                // ets_printf("(D) FHSS locked: %s\n", fhssLockReasonToString(reason));
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
     * Déverrouille le FHSS pour une raison spécifique
     */
    void iohcRadio::unlockFHSS(const FHSSLockReason reason) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            // Déverrouiller seulement si c'est la même raison
            if (fhssLockReason == reason) {
                fhssLockReason = FHSSLockReason::NONE;
                f_lock_hop = false;

                // ets_printf("(D) FHSS unlocked: %s\n", fhssLockReasonToString(reason));
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
        * Force le déverrouillage (pour reset manuel)
        */
    void iohcRadio::forceUnlockFHSS() {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            fhssLockReason = FHSSLockReason::NONE;
            f_lock_hop = false;
            expectingResponse = false;

            // ESP_LOGW("IOHC", "FHSS force unlocked");
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
     * Vérifie si le verrouillage a expiré (watchdog)
     */
    void iohcRadio::checkFHSSTimeout() {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            // todo
            if (f_lock_hop && fhssLockReason != FHSSLockReason::TRANSMITTING) {
                uint32_t elapsed = millis() - lastActivityTime;

                // A 38.4 kb/s, un paquet de 32 bytes
                // ≈ (32 * 8 bits) / 38400 = 6.6 ms de payload + overhead (préambule, sync, CRC…).
                // Total réel de 10 à 15 ms.
                uint32_t timeout = 48; // = expectingResponse ? responseTimeoutMs : FHSS_UNLOCK_TIMEOUT_MS / 3;
                if (fhssLockReason == FHSSLockReason::PREAMBLE_DETECTED) timeout = 44; // lock_timeout (~2× airtime max).
                if (fhssLockReason == FHSSLockReason::RECEIVING) timeout = 22;

                if (elapsed > timeout) {
                    // ets_printf("(D) FHSS timeout, forcing unlock (reason: %s, elapsed: %dms)\n", fhssLockReasonToString(fhssLockReason), elapsed);
                    fhssLockReason = FHSSLockReason::NONE;
                    f_lock_hop = false;
                    expectingResponse = false;
                }
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
     * Met à jour l'horodatage d'activité
     * Pas besoin de mutex pour juste mettre à jour un uint32_t
     */
    // void iohcRadio::updateFHSSActivity() {
    //     if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
    //         lastActivityTime = millis();
    //         xSemaphoreGive(fhss_state_mutex);
    //     }
    // }
    inline void IRAM_ATTR iohcRadio::updateFHSSActivity() {
        lastActivityTime = static_cast<uint32_t>(esp_timer_get_time() / 1000ULL); // micro→ms
    }
    /**
 * Indique qu'on attend une réponse après un envoi
 */
    void iohcRadio::setExpectingResponse(bool expecting, uint32_t timeoutMs = 1000) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            expectingResponse = expecting;
            responseTimeoutMs = timeoutMs;
            if (expecting) {
                lockFHSS(FHSSLockReason::WAITING_RESPONSE);
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }


    iohcRadio::iohcRadio() {
        Radio::initHardware();
        Radio::calibrate();

        Radio::initRegisters(MAX_FRAME_LEN);
        Radio::setCarrier(Radio::Carrier::Deviation, 19200);
        Radio::setCarrier(Radio::Carrier::Bitrate, 38400);
        Radio::setCarrier(Radio::Carrier::Bandwidth, 250);
        Radio::setCarrier(Radio::Carrier::Modulation, Radio::Modulation::FSK);

        // Attach interrupts to Preamble detected and end of packet sent/received
        //        attachInterrupt(RADIO_PACKET_AVAIL, i_payload, CHANGE); //
        //        attachInterrupt(RADIO_PREAMBLE_DETECTED, i_preamble, CHANGE); //
        attachInterrupt(RADIO_DIO0_PIN, handle_interrupt_fromisr, RISING); //CHANGE); //
        //        attachInterrupt(RADIO_DIO1_PIN, handle_interrupt_fromisr, RISING); // CHANGE); //
        attachInterrupt(RADIO_DIO2_PIN, handle_interrupt_fromisr, RISING); //CHANGE); //

        // start state machine
        ets_printf("Starting Interrupt Handler...\n");
        // Créer les mutex
        tx_mutex = xSemaphoreCreateMutex();
        txQueue_mutex = xSemaphoreCreateMutex();
        fhss_state_mutex = xSemaphoreCreateMutex();

        // Créer la queue ISR -> task
        radioIrqQueue = xQueueCreate(RADIO_IRQ_QUEUE_LEN, sizeof(RadioIrqEvent));
        if (!radioIrqQueue) {
            ets_printf("ERROR: radioIrqQueue creation failed\n");
        }

        BaseType_t task_code = xTaskCreatePinnedToCore(handle_interrupt_task, "handle_interrupt_task", 4096,
                                                       this, 4,
                                                       &handle_interrupt, xPortGetCoreID());
        if (task_code != pdPASS) {
            ets_printf("ERROR STATEMACHINE Can't create task %d\n", task_code);
            return;
        }
    }

    /**
     * @brief Returns a pointer to a single instance of the `iohcRadio`
     * class, creating it if it doesn't already exist.
     *
     * @return An instance of the `iohcRadio` class.
     */
    iohcRadio *iohcRadio::getInstance() {
        if (!_iohcRadio)
            _iohcRadio = new iohcRadio();
        return _iohcRadio;
    }

    /**
     * Initializes the radio with specified parameters and sets it to receive mode.
     *
     * @param num_freqs Number of
     * frequencies to scan. It is of type `uint8_t`. This
     * parameter specifies how many frequencies the radio will scan during operation.
     * @param scan_freqs array of `uint32_t` values that represent the
     * frequencies to be scanned during the radio operation. The `start` function initializes the radio
     * with the provided frequencies for scanning.
     * @param scanTimeUs time interval in microseconds for scanning frequencies. If a specific value is
     * provided for `scanTimeUs`, it will be used as the scan interval. Otherwise, the default scan
     * interval defined as
     * @param rxCallback The `rxCallback` is a delegate or
     * function pointer that will be called when a packet is received by the radio. It is set to `nullptr`
     * by default if not provided during the function call.
     * @param txCallback The `txCallback` is a callback function that will be called when a packet is
     * transmitted by the radio. This callback function can be provided by the user
     */
    void iohcRadio::start(uint8_t num_freqs, uint32_t *scan_freqs, uint32_t scanTimeUs,
                          CallbackFunction rxCallback = nullptr, CallbackFunction txCallback = nullptr) {
        this->num_freqs = num_freqs;
        this->scan_freqs = scan_freqs;
        // this->scanTimeUs = scanTimeUs ? scanTimeUs : DEFAULT_SCAN_INTERVAL_US;
        this->rxCB = std::move(rxCallback);
        this->txCB = std::move(txCallback);
        this->currentFreqIdx = 0;
        this->expectingResponse = false;

