cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        // CONFIGURATION PAR DÉFAUT RECOMMANDÉE
        if (scanTimeUs == 0) {
            // Démarrer en mode fast scan
            this->scanTimeUs = 15 * 1000; // 15ms par fréquence
            // ESP_LOGI("FHSS", "Using default adaptive FHSS: 15ms fast scan");
        } else {
            this->scanTimeUs = scanTimeUs;
        }

        Radio::clearBuffer();
        Radio::clearFlags();

        /* We always start at freq[0], the 1W/2W channel*/
        Radio::setCarrier(Radio::Carrier::Frequency, scan_freqs[0]); // CHANNEL2); // 868950000);

        if (this->num_freqs > 1) {
            this->currentFreqIdx = 0;

            // start adaptative
            adaptiveFHSS = new AdaptiveFHSS(this);

            // Start Frequency Hopping Timer
            ets_printf("Starting FHSSTimer Handler...\n");
            adaptiveFHSS->switchToFastScan();
        }
        Radio::setRx();
    }

    /**
     * Handles various radio operations based on different conditions
     * and configurations for SX127X
     *
     * @param radio Pointer to an
     * instance of the `iohcRadio` class. This pointer is used to access and modify the properties and
     * methods of the `iohcRadio` object within the function.
     *
     * Ne rien faire dans l'ISR qui puisse allouer, prendre mutex/sem, ou appeler des fonctions non-ISR-safe.
     * Faire en sorte que tickerCounter() ne fasse que le minimum : lire les IRQ, mettre à jour lastActivityTime, écrire un flag / envoyer une notification vers une task (via xTaskNotifyFromISR() ou xQueueSendFromISR()), et retourner.
     * Tout le traitement (lecture FIFO, allocation, vector insert) doit être fait dans une task FreeRTOS.
     */

    void IRAM_ATTR iohcRadio::tickerCounter(iohcRadio *radio) {
        Radio::readBytes(REG_IRQFLAGS1, _flags, sizeof(_flags));

        if (radioState == iohcRadio::RadioState::PREAMBLE) {
            // Préambule détecté, déjà verrouillé dans l'ISR
        } else if (radioState == iohcRadio::RadioState::PAYLOAD) {
            // if TX ready?
            if (_flags[0] & RF_IRQFLAGS1_TXREADY) {
                radio->sent(radio->new_packet);
                Radio::clearFlags();
                if (radioState != iohcRadio::RadioState::TX) {
                    Radio::setRx();
                    radio->setRadioState(iohcRadio::RadioState::RX);

                    // Only when no response expected
                    //if (/*!radio->expectingResponse &&*/ !txMode) {
                    //    radio->unlockFHSS(FHSSLockReason::TRANSMITTING);
                    //}
                }
                return;
            }
            // Réception de payload
            // maybeCheckHeap("BEFORE RECEIVE IN TICKERCOUNTER");
            radio->receive(false);
            // maybeCheckHeap("AFTER RECEIVE IN TICKERCOUNTER");
            Radio::clearFlags();

            // radio->tickCounter = 0;
            // Après réception, Only when no response expected

            // if (!radio->expectingResponse) {
            // Petit délai avant de déverrouiller pour laisser le temps de traiter
            // et éventuellement envoyer une réponse
            // vTaskDelay(pdMS_TO_TICKS(50));
            // radio->forceUnlockFHSS();
            // }
        }

    }
    /**
         * Crée un wrapper de paquet de manière SÉCURISÉE
         * Retourne nullptr si allocation échoue (au lieu de crasher)
         */
    static TxPacketWrapper* IRAM_ATTR createPacketWrapper(iohcPacket* sourcePacket) {
        if (!sourcePacket) {
            ets_printf("createPacketWrapper: sourcePacket is null\n");
            return nullptr;
        }

        // Essayer d'allouer d'abord la copie du paquet
        iohcPacket* pktToSend = nullptr;

        pktToSend = new (std::nothrow) iohcPacket(*sourcePacket);
        if (!pktToSend) {
            ets_printf("createPacketWrapper: Failed to allocate packet copy\n");
            return nullptr;  // Fuite zéro - rien n'a été alloué
        }

        // Ensuite allouer le wrapper
        auto wrapper = new (std::nothrow) TxPacketWrapper(pktToSend);
        if (!wrapper) {
            ets_printf("createPacketWrapper: Failed to allocate wrapper\n");
            // Libérer le paquet
            delete pktToSend;
            return nullptr;  // Fuite zéro
        }

        return wrapper;
    }
    /**
 * Sends packets stored in a vector with a specified repeat time.
 *
 * @param TxPackets `iohcTx` is a reference to a vector of pointers to `iohcPacket` objects.
*
 * Envoie un ou plusieurs paquets
 * Les paquets sont COPIÉS en interne, on garde la propriété des originaux
 */
    bool iohcRadio::send(std::vector<iohcPacket *> &TxPackets) {
        if (TxPackets.empty()) return false;

        // Pas de sémaphore bloquant, simple spinlock
        uint32_t timeout = millis() + 100;  // Timeout 100ms
        while (txQueue_busy && millis() < timeout) {
            vTaskDelay(pdMS_TO_TICKS(1));  // OK ici (pas ISR)
        }

        if (txQueue_busy) {
            ets_printf("TX queue timeout");
            return false;
        }

        txQueue_busy = true;  // Acquérir le "lock"

        txCounter = 0;
        // Ajouter chaque paquet à la queue (en faisant une COPIE)
        for (auto *pkt: TxPackets) {
            if (!pkt) continue;
            // Créer une COPIE du paquet
            // iohcPacket *packetCopy = new iohcPacket(*pkt);
            // TxPacketWrapper *wrapper = new TxPacketWrapper(packetCopy, true);
            // txQueue.push_back(wrapper);

            // Utiliser la factory function
            TxPacketWrapper* wrapper = createPacketWrapper(pkt);
            if (wrapper) {
                txQueue.push_back(wrapper);
                // packetsAdded++;
            } else {
                // Log l'erreur, mais continue avec les autres
                ets_printf("Failed to add packet to queue (memory issue?)");
            }
        }
        TxPackets.clear();
        txQueue_busy = false;  // Libérer le "lock"
        startTransmission();
        return true;

