cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
    }

    /**
     * Send a single packet, to help reveiced the answer in another frequency
     */
    bool iohcRadio::sendSingle(iohcPacket *packet) {
        if (!packet) return false;
// todo utiliser mutex vtaskdelay too slow
        uint32_t timeout = millis() + 100;
        while (txQueue_busy && millis() < timeout) {
            vTaskDelay(pdMS_TO_TICKS(1));
        }

        // if (txQueue_busy) {
        //     ets_printf("TX queue timeout in sendSingle\n");
        //     return false;
        // }

        txQueue_busy = true;

        // iohcPacket *pktToSend = new iohcPacket(*packet) ;
        // TxPacketWrapper *wrapper = new TxPacketWrapper(pktToSend, true);
        // txQueue.push_back(wrapper);
        // Utiliser la factory function
        TxPacketWrapper* wrapper = createPacketWrapper(packet);
        if (wrapper) txQueue.push_back(wrapper);
        else {
            txQueue_busy = false;
            ets_printf("sendSingle: Failed to create packet wrapper");
            return false;
        }

        txQueue_busy = false;
        startTransmission();
        return true;
    }

    /**
     * Insère un paquet en priorité (au début de la queue)
    * Utile pour les réponses urgentes
    */
    bool iohcRadio::sendPriority(iohcPacket *packet) {
        if (!packet) return false;

        uint32_t timeout = millis() + 100;
        while (txQueue_busy && millis() < timeout) {
            vTaskDelay(pdMS_TO_TICKS(1));
        }

        if (txQueue_busy) {
            ets_printf("TX queue timeout in sendPriority\n");
            return false;
        }

        txQueue_busy = true;

        // Ajouter le paquet prioritaire
        // iohcPacket *pktToSend = new iohcPacket(*packet);
        // TxPacketWrapper *wrapper = new TxPacketWrapper(pktToSend, true);
        // Utiliser la factory function
        TxPacketWrapper* wrapper = createPacketWrapper(packet);
        // O(1)
        if (wrapper) txQueue.push_front(wrapper);
        else {
            txQueue_busy = false;
            ets_printf("sendPriority: Failed to create packet wrapper");
            return false;
        }

        txQueue_busy = false;
        startTransmission();
        return true;
    }

    /**
     * Handles the transmission of packets using radio
     * communication, including frequency setting, packet preparation, and handling of repeated
     * transmissions.
     *
     * @param radio Pointer to an object of type
     * `iohcRadio`. It is used to access and manipulate data and functions within the `iohcRadio` class.
     */
    void IRAM_ATTR iohcRadio::packetSender(iohcRadio *radio) {
        if (!radio || !radio->currentTxPacket) {
            ets_printf("packetSender called with null pointer");
            return;
        }

        digitalWrite(RX_LED, digitalRead(RX_LED) ^ 1);

        // Verrouiller pour transmission
        radio->lockFHSS(FHSSLockReason::TRANSMITTING);
        // radio->updateFHSSActivity();
        txMode = true;

        iohcPacket *pkt = radio->currentTxPacket->packet;

        // Use the frequency of the packet if specified. 1W is always set at CHANNEL2
        if (pkt->frequency == 0) pkt->frequency = radio->scan_freqs[radio->currentFreqIdx];;
        if (pkt->frequency != radio->scan_freqs[radio->currentFreqIdx]) {
            Radio::setCarrier(Radio::Carrier::Frequency, pkt->frequency);
        } else {
            pkt->frequency = radio->scan_freqs[radio->currentFreqIdx];
        }

        Radio::setStandby();
        Radio::clearFlags();
        // Not needed at start as already done at init
        // Radio::setPreambleLength(LONG_PREAMBLE_MS); //repeat?LONG_PREAMBLE_MS:SHORT_PREAMBLE_MS);
        Radio::writeBytes(REG_FIFO, pkt->payload.buffer, pkt->buffer_length);
        Radio::setTx();
        radio->setRadioState(iohcRadio::RadioState::TX);
        // There is no need to maintain radio locked between packets transmission unless clearly asked
        txMode = pkt->lock;

        packetStamp = esp_timer_get_time();
        pkt->decode(true);
        // Memorize last command sent
        IOHC::lastCmd = pkt->cmd();
        // Used for replies in main
        // iohcCozyDevice2W *cozyDevice2W = iohcCozyDevice2W::getInstance();
        // cozyDevice2W->memorizeSend.memorizedCmd = IOHC::lastCmd;
        // cozyDevice2W->memorizeSend.memorizedData = {pkt->payload.buffer+9, pkt->payload.buffer+radio->new_packet->buffer_length};
        // cozyDevice2W->memorizeSend.memorizedData.assign(pkt->payload.buffer+9, pkt->payload.buffer+pkt->buffer_length);
        // Vérifier si ce paquet attend une réponse
        // (vous pouvez ajouter un flag dans iohcPacket pour ça)
        // bool thisPacketExpectsResponse = pkt->expectsResponse;  // À ajouter dans iohcPacket

        if (pkt->repeat > 0) {
            // Only the first frame is LPM (1W)
            pkt->payload.packet.header.CtrlByte2.asStruct.LPM = 0;
            pkt->repeat--;
        }
        if (pkt->repeat == 0) {
            radio->Ticker.detach();

            // Utiliser spinlock au lieu de sémaphore
            uint32_t timeout = esp_timer_get_time() + 50000;  // 50ms en microsecondes
            while (radio->txQueue_busy && esp_timer_get_time() < timeout) {
                // Spinlock court - OK dans ISR
            }

            // Vérifier s'il y a un délai avant le prochain paquet
            bool hasNextPacket = false;
            uint32_t nextDelay = 0;

            // VÉRIFICATION RAPIDE sans modifier la queue
            if (!radio->txQueue_busy && !radio->txQueue.empty()) {
                hasNextPacket = true;
                nextDelay = radio->txQueue.front()->repeatTime;
            }

            if (hasNextPacket && nextDelay > 0) {
                // Délai avant le prochain paquet
                radio->Ticker.delay_ms(nextDelay, processNextPacketCallback, radio);
            } else if (hasNextPacket) {
                // Pas de délai, traiter immédiatement
                radio->processNextPacket();
            } else {
                // Plus de paquets à envoyer
                txMode = false;

                // Si on attend une réponse, GARDER le verrouillage
                // if (thisPacketExpectsResponse) {
                // radio->setExpectingResponse(true, 1000);  // 1 seconde de timeout
                // } else {
                // Sinon déverrouiller
                radio->unlockFHSS(FHSSLockReason::TRANSMITTING);
                // }
                // Plus de paquets, arrêter
                radio->stopTransmission();
            }
        }

        digitalWrite(RX_LED, digitalRead(RX_LED) ^ 1);
    }

    /**
     * Checks if a callback function `txCB` is set and calls
     * it with a packet as a parameter, returning the result.
     *
     * @param packet The `packet` parameter is a pointer to an object of type `iohcPacket`.
     *
     * @return  boolean , which is determined by the result of
     * calling the `txCB` function with the `packet` parameter. If `txCB` is not null, the return value
     * will be the result of calling `txCB(packet)`, otherwise it will be `false`.
     */
    bool IRAM_ATTR iohcRadio::sent(iohcPacket *packet) {
        bool ret = false;
        if (txCB) ret = txCB(packet);
        return ret;
    }

