cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
    // La "mémoire tampon" pour le paquet reçu. Elle existe en permanence.
    static iohcPacket rxPacketBuffer;
    /**
     * Toggles an LED, reads radio data, processes it, and
     * triggers a callback function.
     *
     * @param stats TDetermine whether to gather additional statistics during the radio reception process. If
     * `stats` is set to `true`, the function will collect and process additional information such as RSSI
     *
     * @return Boolean value `true`.
     */
    bool IRAM_ATTR iohcRadio::receive(bool stats = false) {
        digitalWrite(RX_LED, digitalRead(RX_LED) ^ 1);
        // On est déjà verrouillé par l'ISR/tickerCounter

        // Create a new packet for this reception. Use a pointer to pass to the callback.
        // auto *currentPacket = new iohcPacket();
        // 1. OBTENIR UN POINTEUR, SANS ALLOCATION
        // On ne demande pas de nouvelle mémoire. On prend juste l'adresse
        // de notre buffer qui existe déjà. C'est une opération instantanée.
        iohcPacket* currentPacket = &rxPacketBuffer;
        // 2. "NETTOYER L'ASSIETTE" (TRÈS IMPORTANT !)
        // Comme on réutilise le même paquet, il faut le vider de ses anciennes
        // données avant de le remplir avec les nouvelles.
        // Vous devez ajouter cette petite fonction à votre classe iohcPacket.
        currentPacket->reset();
        currentPacket->frequency = scan_freqs[currentFreqIdx];

        _g_payload_millis = esp_timer_get_time();
        packetStamp = _g_payload_millis;

        if (stats) {
            currentPacket->rssi = static_cast<float>(Radio::readByte(REG_RSSIVALUE)) / -2.0f;
            int16_t thres = Radio::readByte(REG_RSSITHRESH);
            currentPacket->snr = currentPacket->rssi > thres ? 0 : (thres - currentPacket->rssi);
            int16_t f = static_cast<uint16_t>(Radio::readByte(REG_AFCMSB));
            f = (f << 8) | static_cast<uint16_t>(Radio::readByte(REG_AFCLSB));
            currentPacket->afc = f * 61.0;
        }

        while (Radio::dataAvail()) {
            if (currentPacket->buffer_length < MAX_FRAME_LEN) {
                currentPacket->payload.buffer[currentPacket->buffer_length++] = Radio::readByte(REG_FIFO);
            } else {
                // Prevent buffer overflow, discard extra bytes.
                Radio::readByte(REG_FIFO);
            }
        }

        if (*currentPacket == last1wPacket && currentPacket->is1W()) {
            // ets_printf("Same packet, skipping\n");
        } else {
            // if (expectingResponse && isResponsePacket(currentPacket)) {
            //     setExpectingResponse(false);
            //     unlockFHSS(FHSSLockReason::WAITING_RESPONSE);
            // }

            if (rxCB) rxCB(currentPacket);
            currentPacket->decode(true); //stats);
            // addLogMessage(String(currentPacket->decodeToString(true).c_str()));

            // Save the new packet's data for the next comparison
            last1wPacket = *currentPacket;
        }
        // 3. PAS DE 'DELETE' !
        // Puisqu'on n'a jamais fait de 'new', il ne faut surtout pas faire de 'delete'.
        // Il n'y a rien à libérer, le buffer attend simplement le prochain appel.
        // delete currentPacket; // The packet is processed or duplicated, we can free it.
        // this->getInstance()->unlockFHSS(FHSSLockReason::RECEIVING);
        // Déverrouiller le hopping après réception

        digitalWrite(RX_LED, false);
        return true;
    }

    // HELPER : Détecter si un paquet est une réponse
    bool iohcRadio::isResponsePacket(iohcPacket *packet) {
        // À adapter
        // Vérifier si c'est une réponse au dernier cmd envoyé
        if (!packet) return false;

        // Exemple : si le paquet contient un ACK ou une réponse au dernier cmd
        return (packet->payload.packet.header.cmd == IOHC::lastCmd + 1) /*||
               (packet->payload.packet.header.CtrlByte1.asStruct.type == PACKET_TYPE_RESPONSE)*/;
    }

    /**
     * @deprecated The function `i_preamble` sets the value of `f_lock` based on the state of `_g_preamble`
     */
    // void IRAM_ATTR iohcRadio::i_preamble() {
    //     _g_preamble = digitalRead(RADIO_PREAMBLE_DETECTED);
    //     f_lock = _g_preamble;
    //     iohcRadio::setRadioState(_g_preamble ? iohcRadio::RadioState::PREAMBLE : iohcRadio::RadioState::RX);
    // }

    /**
     * @deprecated The function `iohcRadio::i_payload()` reads the value of a digital pin and stores it in a variable
     * `_g_payload`
     */
    // void IRAM_ATTR iohcRadio::i_payload() {
    //     _g_payload = digitalRead(RADIO_PACKET_AVAIL);
    //     iohcRadio::setRadioState(_g_payload ? iohcRadio::RadioState::PAYLOAD : iohcRadio::RadioState::RX);
    // }


    void IRAM_ATTR iohcRadio::setRadioState(const RadioState newState) {
        radioState = newState;
    }

    /**
* Callback statique pour le délai entre paquets
*/
    void IRAM_ATTR iohcRadio::processNextPacketCallback(iohcRadio *radio) {
        if (radio) {
            radio->processNextPacket();
        }
    }

    /**
* Démarre la transmission si pas déjà en cours
*/
    void iohcRadio::startTransmission() {
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(10)) != pdTRUE) {
            return;
        }

        if (!isSending) {
            isSending = true;
            xSemaphoreGive(tx_mutex);

            // Lancer le premier paquet
            processNextPacket();
        } else {
            xSemaphoreGive(tx_mutex);
        }
    }

    /**
     * Traite le prochain paquet de la queue
     */
    void iohcRadio::processNextPacket() {
        // Récupérer le prochain paquet
        uint32_t timeout = millis() + 100;
        while (txQueue_busy && millis() < timeout) {
            vTaskDelay(pdMS_TO_TICKS(1));
        }

        // Nettoyer le paquet précédent
        // if (currentTxPacket) {
        //     delete currentTxPacket;
        //     currentTxPacket = nullptr;
        // }

        if (txQueue_busy) {
            ets_printf("TX queue timeout in processNextPacket()");
            stopTransmission();
            return;
        }

