cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        if (txQueue.empty()) {
            stopTransmission();
            return;
        }

        currentTxPacket = txQueue.front();
        txQueue.pop_front();

        // Lancer le timer pour ce paquet
        Ticker.attach_ms(currentTxPacket->repeatTime, packetSender, this);
    }

    /**
     * Arrête la transmission
     */
    void iohcRadio::stopTransmission() {
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            isSending = false;
            Ticker.detach();

            // Nettoyer le paquet courant
            if (currentTxPacket) {
                delete currentTxPacket;
                currentTxPacket = nullptr;
            }

            // Déverrouiller la radio
            if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                txMode = false;
                f_lock_hop = false;
                xSemaphoreGive(fhss_state_mutex);
            }

            xSemaphoreGive(tx_mutex);
        }
    }

    /**
     * Vide la queue de transmission
     */
    void iohcRadio::clearTxQueue() {
        uint32_t timeout = millis() + 100;
        while (txQueue_busy && millis() < timeout) {
            vTaskDelay(pdMS_TO_TICKS(1));
        }

        txQueue_busy = true;

            while (!txQueue.empty()) {
                const TxPacketWrapper *wrapper = txQueue.front();
                txQueue.pop_front();
                delete wrapper; // Le destructeur libère la mémoire
            }
        txQueue_busy = false;
    }

    /**
         * Vérifie si une transmission est en cours
         */
    bool iohcRadio::isTransmitting() const {
        bool transmitting = false;
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            transmitting = isSending;
            xSemaphoreGive(tx_mutex);
        }
        return transmitting;
    }

    /**
     * Annule toutes les transmissions en cours
     */
    void iohcRadio::cancelTransmissions() {
        Ticker.detach();
        clearTxQueue();
        stopTransmission();
    }
}
